# Analytical Automation Failures Properties

Source: https://www.revitapidocs.com/2026/ba149a61-3e2d-b7b6-d5e7-ae1cc35bde13.htm

---

| Analytical Automation Failures Properties |
| --- |

The BuiltInFailures AnalyticalAutomationFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | EmptySelection | There are no selected elements. |

Top See Also

#### Reference

BuiltInFailures AnalyticalAutomationFailures Class Autodesk.Revit.DB Namespace